{
  "products": [
    {
      "title": "Writing Supplies",
      "items": [
        {
          "id": 1,
          "promptUsed": "A high-quality image of a pack of pencils inside its package with a plain white background. The package should be clear, showcasing the pencils in an ",
          "imageGeneratedBy": "DALL-E",
          "filename": "colored-pencils.jpg",
          "product_id": "P001",
          "name": "Colored Pencils",
          "price": 4.49,
          "description": "A pack of high-quality pencils, perfect for writing, drawing, and school activities. Each pencil is designed with a smooth finish and a sharp point for consistent use."
        },
        {
          "id": 2,
          "promptUsed": "A high-quality image of a set of markers inside its package with a plain white background. The package should be clear, showcasing the markers in an o",
          "imageGeneratedBy": "DALL-E",
          "filename": "markers-assorted-colors-26-pk.jpg",
          "product_id": "P002",
          "name": "Set of Markers",
          "price": 8.99,
          "description": "A set of vibrant markers in multiple colors. Ideal for school or office use, these markers provide smooth and consistent color application."
        },
        {
          "id": 3,
          "promptUsed": "A high-quality image of a spiral notebook with a simple and clean background. The notebook should be centered in the frame, showcasing its spiral bind",
          "imageGeneratedBy": "DALL-E",
          "filename": "spiral-notebook-basic.webp",
          "product_id": "P003",
          "name": "Spiral Notebook",
          "price": 2.99,
          "description": "A classic spiral notebook with a black-and-white marble design, perfect for school and personal use. The notebook features durable spiral binding and lined pages for easy writing."
        },
        {
          "id": 4,
          "promptUsed": "A high-quality image of a set of black writing pencils inside its package with a plain white background. The package should be clear, showcasing the b",
          "imageGeneratedBy": "DALL-E",
          "filename": "pencils-15-pk.webp",
          "product_id": "P004",
          "name": "Writing Pencils",
          "price": 4.99,
          "description": "A set of high-quality black writing pencils, ideal for school and personal use. Each pencil features a smooth and durable graphite core for consistent writing."
        },
        {
          "id": 7,
          "promptUsed": "A high-quality image of a 4-pack of highlighters inside its package with a plain white background. The package should be clear, showcasing the 4 highl",
          "imageGeneratedBy": "DALL-E",
          "filename": "highlighters-mini-assorted.webp",
          "product_id": "P007",
          "name": "Highlighters Mini Assorted",
          "price": 4.99,
          "description": "A set of high-quality mini highlighters, ideal for school and personal use. Each highlighter features a smooth and durable graphite core for consistent writing."
        },
        {
          "id": 8,
          "promptUsed": "A high-quality image of a pack of dry-erase markers with an eraser and a cleaner bottle inside the package, similar to the attached image. The pack sh",
          "imageGeneratedBy": "DALL-E",
          "filename": "dry-erase-markers-eraser-cleaner-bottle.webp",
          "product_id": "P008",
          "name": "Dry-Erase Markers",
          "price": 4.99,
          "description": "A pack of dry-erase markers, featuring an eraser and a cleaner bottle, ideal for writing and drawing. The markers are designed for smooth writing and easy removal."
        },
        {
          "id": 9,
          "promptUsed": "A high-quality image of a closed composition notebook with a black-and-white marble design, showing only the front cover and the spiral binding, with ",
          "imageGeneratedBy": "DALL-E",
          "filename": "composition-notebook-spiral-1.webp",
          "product_id": "P009",
          "name": "Composition Notebook Spiral",
          "price": 3.99,
          "description": "A composition notebook, featuring a black-and-white marble design on the cover. The notebook features durable spiral binding and lined pages for easy writing."
        },
        {
          "id": 10,
          "promptUsed": "A high-quality image of a composition notebook with a plain cover, typically used for writing or schoolwork. The notebook should have a black-and-whit",
          "imageGeneratedBy": "DALL-E",
          "filename": "composition-notebook-spiral-2.webp",
          "product_id": "P010",
          "name": "Composition Notebook Spiral",
          "price": 3.99,
          "description": "A composition notebook, featuring a black-and-white marble design on the cover. The notebook features durable spiral binding and lined pages for easy writing."
        },
        {
          "id": 11,
          "promptUsed": "A high-quality image of an open composition notebook with a black-and-white marble design on the cover. The notebook should be opened to show the line",
          "imageGeneratedBy": "DALL-E",
          "filename": "composition-notebook-spiral-3.webp",
          "product_id": "P011",
          "name": "Composition Notebook Spiral",
          "price": 3.99,
          "description": "A composition notebook, featuring a black-and-white marble design on the cover. The notebook features durable spiral binding and lined pages for easy writing."
        },
        {
          "id": 42,
          "promptUsed": "N/A",
          "imageGeneratedBy": "Gemini",
          "filename": "spiral-notebook-pastel-design-1.jpeg",
          "product_id": "P042",
          "name": "Pastel Gradient Spiral Notebook",
          "price": 3.99,
          "description": "A spiral-bound notebook with a durable pastel gradient cover transitioning from soft pink to blue and yellow hues. Features 120 lined pages, perfect for note-taking and journaling."
        },
        {
          "id": 43,
          "promptUsed": "N/A",
          "imageGeneratedBy": "Gemini",
          "filename": "colored-ballpens-7-pk.jpeg",
          "product_id": "P043",
          "name": "Colored Ballpoint Pens - 7 Pack",
          "price": 2.99,
          "description": "A pack of 7 colored ballpoint pens in various colors. Perfect for writing, drawing, and creative projects."
        }
      ]
    },
    {
      "title": "Organization & Storage",
      "items": [
        {
          "id": 5,
          "promptUsed": "A high-quality image of a pack of sticky notes inside its package with a plain white background. The package should be clear, showcasing the sticky no",
          "imageGeneratedBy": "DALL-E",
          "filename": "sticky-flags.webp",
          "product_id": "P005",
          "name": "Sticky Notes",
          "price": 3.29,
          "description": "A pack of bright and colorful sticky notes for quick notes and reminders. Available in vibrant colors, these notes stick easily to surfaces and remove cleanly without residue."
        },
        {
          "id": 6,
          "promptUsed": "A high-quality image of square sticky notes inside its package with a plain white background. The package should be clear, showcasing the square stick",
          "imageGeneratedBy": "DALL-E",
          "filename": "sticky-notes-4-pk.webp",
          "product_id": "P006",
          "name": "Square Sticky Notes",
          "price": 2.99,
          "description": "A pack of square sticky notes, perfect for organizing your workspace or personal use. Each note is made of high-quality paper and features a sticky back for easy attachment."
        },
        {
          "id": 19,
          "promptUsed": "A high-quality image of a 3-ring binder, with the binder displayed in a straightforward position. The binder should have a simple design, with a durab",
          "imageGeneratedBy": "DALL-E",
          "filename": "3-ring-binder-3-in.webp",
          "product_id": "P019",
          "name": "3-Ring Binder",
          "price": 7.99,
          "description": "A 3-ring binder made from sturdy material, ideal for organizing documents, notes, and schoolwork. The binder comes in neutral colors like black or navy."
        },
        {
          "id": 29,
          "promptUsed": "A 3-ring binder with a smooth, pastel gradient design, transitioning from soft pink to blue and yellow hues. The binder has a glossy finish with a sub",
          "imageGeneratedBy": "DALL-E",
          "filename": "3-ring-binder-pastel-gradient-1.webp",
          "product_id": "P029",
          "name": "3-Ring Binder with Pastel Design",
          "price": 5.49,
          "description": "A stylish 3-ring binder with a pastel gradient cover. Includes metal rings for durability and spacious capacity for documents or class notes."
        }
      ]
    },
    {
      "title": "Art Supplies",
      "items": [
        {
          "id": 12,
          "promptUsed": "A high-quality image of a bottle of glue. The glue bottle should have a simple, clean design with a bright color, such as white or clear with a label ",
          "imageGeneratedBy": "DALL-E",
          "filename": "glue-bottle-1.webp",
          "product_id": "P012",
          "name": "Bottle of Glue",
          "price": 3.99,
          "description": "A bottle of glue, perfect for various crafting projects. The glue dries clear and bonds effectively on paper, cardboard, and more."
        },
        {
          "id": 18,
          "promptUsed": "A high-quality image of a pack of scissors, with the scissors displayed inside their packaging. The scissors should be designed for general use, featu",
          "imageGeneratedBy": "DALL-E",
          "filename": "pair-of-scissors-1.webp",
          "product_id": "P018",
          "name": "Pair of Scissors",
          "price": 5.99,
          "description": "A pair of scissors with a sharp point and a durable metal handle."
        },
        {
          "id": 31,
          "promptUsed": "A sketchbook with a pastel gradient hardcover, transitioning from soft pink to blue and yellow hues. The sketchbook features spiral binding along the ",
          "imageGeneratedBy": "DALL-E",
          "filename": "sketchbook-spiral-1.webp",
          "product_id": "P031",
          "name": "Sketchbook with Gradient Hardcover",
          "price": 6.99,
          "description": "A hardcover sketchbook featuring a pastel gradient design. Includes 100 blank pages with a smooth texture for drawing and sketching."
        },
        {
          "id": 41,
          "promptUsed": "N/A",
          "imageGeneratedBy": "Gemini",
          "filename": "colored-pencils-8-pk.jpeg",
          "product_id": "P041",
          "name": "Colored Pencils - 8 Pack",
          "price": 4.99,
          "description": "A pack of 8 colored pencils in various shades and sizes. Perfect for drawing, writing, and creative projects."
        }
      ]
    },
    {
      "title": "Bags & Accessories",
      "items": [
        {
          "id": 13,
          "promptUsed": "A high-quality image of a backpack designed for kids, featuring a playful and fun design. The backpack should have bright, cheerful colors like red, b",
          "imageGeneratedBy": "DALL-E",
          "filename": "backpack-for-kids-1.webp",
          "product_id": "P013",
          "name": "Backpack for Kids",
          "price": 24.99,
          "description": "A backpack designed for kids, featuring a playful and fun design. Kids can carry their essentials with ease and style."
        },
        {
          "id": 14,
          "promptUsed": "A high-quality image of a backpack designed for girls, featuring a stylish and functional design. The backpack should be in bright, feminine colors su",
          "imageGeneratedBy": "DALL-E",
          "filename": "backpack-for-girls-1.webp",
          "product_id": "P014",
          "name": "Backpack for Girls",
          "price": 24.99,
          "description": "A backpack designed for girls, featuring a stylish and functional design. Girls can carry their essentials with ease and style."
        },
        {
          "id": 15,
          "promptUsed": "A high-quality image of a backpack designed for boys, featuring a sporty and practical design. The backpack should have a dark color palette with shad",
          "imageGeneratedBy": "DALL-E",
          "filename": "backpack-for-boys-1.webp",
          "product_id": "P015",
          "name": "Backpack for Boys",
          "price": 24.99,
          "description": "A backpack designed for boys, featuring a sporty and practical design. Boys can carry their essentials with ease and style."
        },
        {
          "id": 16,
          "promptUsed": "A high-quality image of a simple backpack with a clean design. The backpack should be displayed in a straightforward position, showcasing its main com",
          "imageGeneratedBy": "DALL-E",
          "filename": "backpack-simple-1.webp",
          "product_id": "P016",
          "name": "Simple Backpack",
          "price": 24.99,
          "description": "A simple backpack with a clean design. It features a spacious main compartment, adjustable straps, and a comfortable, ergonomic build."
        },
        {
          "id": 17,
          "promptUsed": "A high-quality image of a laptop bag with straps for carrying over the neck, set against a plain white background. The bag should have a sleek, minima",
          "imageGeneratedBy": "DALL-E",
          "filename": "laptop-bag-1.webp",
          "product_id": "P017",
          "name": "Laptop Bag",
          "price": 24.99,
          "description": "A laptop bag with straps for carrying over the neck. The bag features a sleek and professional design, with a spacious main compartment and adjustable straps."
        }
      ]
    },
    {
      "title": "Math & Science Tools",
      "items": [
        {
          "id": 20,
          "promptUsed": "A high-quality image of a measuring compass inside its packet. The compass should be displayed in a straightforward position, with the sharp point and",
          "imageGeneratedBy": "DALL-E",
          "filename": "measuring-compass-1.webp",
          "product_id": "P020",
          "name": "Measuring Compass",
          "price": 7.99,
          "description": "A high-precision measuring compass for drawing circles and arcs. It comes inside a simple protective packet, ideal for use in math or geometry classes."
        },
        {
          "id": 21,
          "promptUsed": "A high-quality image of a set of math tools inside one packet. The set should include a compass, a protractor, a ruler, and a set square. All items sh",
          "imageGeneratedBy": "DALL-E",
          "filename": "math-tools-set-1.webp",
          "product_id": "P021",
          "name": "Set of Math Tools",
          "price": 13.99,
          "description": "A set of high-quality math tools, including a measuring compass, protractor, ruler, and set square. Ideal for use in math or geometry classes."
        },
        {
          "id": 22,
          "promptUsed": "A high-quality image of a calculator with a simple and clean design. The calculator should have a basic layout with buttons for numbers, basic operati",
          "imageGeneratedBy": "DALL-E",
          "filename": "calculator-basic-1.webp",
          "product_id": "P022",
          "name": "Calculator",
          "price": 12.99,
          "description": "A basic calculator with simple arithmetic functions, designed for everyday school use. The calculator has a clean and user-friendly layout with clear buttons."
        },
        {
          "id": 23,
          "promptUsed": "A high-quality image of a scientific calculator similar to the TI-83, with a clean and professional design. The calculator should have a large screen,",
          "imageGeneratedBy": "DALL-E",
          "filename": "calculator-scientific-1.webp",
          "product_id": "P022",
          "name": "Scientific Calculator",
          "price": 19.99,
          "description": "A scientific calculator with advanced functions like trigonometry, logarithms, and exponential calculations. Designed for students and professionals, it features a large screen and easy-to-use keys."
        },
        {
          "id": 39,
          "promptUsed": "A colorful microscope product packaging design similar to educational science kits. The box features a vibrant blue and green theme, with the image of",
          "imageGeneratedBy": "DALL-E",
          "filename": "microscope-kids-1.webp",
          "product_id": "P039",
          "name": "Microscope with Accessories - Kids",
          "price": 99.99,
          "description": "A professional microscope packaged with lenses, slides, and tweezers. Comes in a secure foam box for storage and portability."
        },
        {
          "id": 40,
          "promptUsed": "A professional microscope product packaging design displayed on a clean white surface. The box features a sleek and minimalistic style with a matte bl",
          "imageGeneratedBy": "DALL-E",
          "filename": "microscope-professional-1.webp",
          "product_id": "P062",
          "name": "Microscope with Accessories - Professional",
          "price": 129.99,
          "description": "A professional microscope packaged with lenses, slides, and tweezers. Comes in a secure foam box for storage and portability."
        }
      ]
    },
    {
      "title": "School Essentials",
      "items": [
        {
          "id": 24,
          "promptUsed": "A high-quality image of a water bottle designed for school use. The bottle should be made of durable material, such as stainless steel or BPA-free pla",
          "imageGeneratedBy": "DALL-E",
          "filename": "water-bottle-1.webp",
          "product_id": "P024",
          "name": "Water Bottle for School",
          "price": 7.99,
          "description": "A durable water bottle perfect for school, made from BPA-free plastic or stainless steel. It features a leak-proof cap and is available in vibrant colors like blue, pink, and green."
        },
        {
          "id": 25,
          "promptUsed": "A high-quality image of a simpler school lunch box with a minimal design. The lunch box should be made from durable plastic, such as BPA-free polyethylene, in a solid color like blue or green",
          "imageGeneratedBy": "DALL-E",
          "filename": "lunch-box-1.webp",
          "product_id": "P025",
          "name": "Lunch Box for School",
          "price": 14.99,
          "description": "A sturdy lunch box designed for school use, made from durable materials like plastic or stainless steel. The lunch box has a secure clasp and a handle for easy carrying."
        }
      ]
    },
    {
      "title": "Office Supplies",
      "items": [
        {
          "id": 26,
          "promptUsed": "A high-quality image of a smaller pack of printing paper with a simple background. The pack should be neatly stacked, showcasing the ream of paper in ",
          "imageGeneratedBy": "DALL-E",
          "filename": "computer-paper-1.webp",
          "product_id": "P026",
          "name": "Computer Paper",
          "price": 4.99,
          "description": "A pack of printing paper designed for office use, made from durable materials like paper or paperboard. The paper is perfect for writing, drawing, and printing documents."
        },
        {
          "id": 27,
          "promptUsed": "A high-quality image of an electric pencil sharpener with a simple background. The sharpener should have a sleek, modern design, with clear details of",
          "imageGeneratedBy": "DALL-E",
          "filename": "electric-pencil-sharpener-1.webp",
          "product_id": "P027",
          "name": "Electric Sharpener",
          "price": 14.99,
          "description": "A modern electric sharpener with a matte black and silver design. Includes a transparent shavings container and sharpens pencils efficiently."
        },
        {
          "id": 32,
          "promptUsed": "A wall calendar featuring a pastel gradient design, transitioning smoothly from soft pink to blue and yellow hues. The calendar displays a minimalist ",
          "imageGeneratedBy": "DALL-E",
          "filename": "calendar-2025-1.webp",
          "product_id": "P032",
          "name": "Wall Calendar with Pastel Gradient",
          "price": 7.99,
          "description": "A wall calendar featuring a pastel gradient design and minimalist typography. Includes monthly layouts with space for notes."
        },
        {
          "id": 38,
          "promptUsed": "A modern electric pencil sharpener with a sleek, compact design. The sharpener features a matte black and silver finish, with a transparent shavings c",
          "imageGeneratedBy": "DALL-E",
          "filename": "pencil-sharpener-electric-1.webp",
          "product_id": "P038",
          "name": "Electric Sharpener",
          "price": 14.99,
          "description": "A modern electric sharpener with a matte black and silver design. Includes a transparent shavings container and sharpens pencils efficiently."
        }
      ]
    },
    {
      "title": "Decorative Items",
      "items": [
        {
          "id": 28,
          "promptUsed": "A high-quality image of a math poster, showcasing a clear, educational design. The poster should feature various mathematical concepts, such as multip",
          "imageGeneratedBy": "DALL-E",
          "filename": "math-poster-1.webp",
          "product_id": "P028",
          "name": "Math Poster",
          "price": 8.99,
          "description": "An educational math poster that showcases various mathematical concepts such as multiplication tables, geometry shapes, and algebra formulas. The layout is colorful and engaging for students."
        },
        {
          "id": 30,
          "promptUsed": "A single roll of washi tape with a pastel gradient design, transitioning smoothly from soft pink to blue and yellow hues. The roll is displayed on a c",
          "imageGeneratedBy": "DALL-E",
          "filename": "washi-tape-1.webp",
          "product_id": "P030",
          "name": "Single Pastel Washi Tape Roll",
          "price": 1.99,
          "description": "A single roll of pastel washi tape with a smooth gradient design. Ideal for decorating planners, notebooks, or gifts."
        }
      ]
    },
    {
      "title": "Educational Materials",
      "items": [
        {
          "id": 33,
          "promptUsed": "A hardcover textbook for History with a clean and professional design. The cover features a pastel gradient background transitioning from soft beige t",
          "imageGeneratedBy": "DALL-E",
          "filename": "textbook-history-1.webp",
          "product_id": "P033",
          "name": "History Textbook",
          "price": 24.99,
          "description": "A hardcover History textbook with a minimalistic pastel design. Highlights key historical eras and events with engaging visuals."
        },
        {
          "id": 34,
          "promptUsed": "A hardcover textbook for Science with a clean and professional design. The cover features a pastel gradient background transitioning from soft green t",
          "imageGeneratedBy": "DALL-E",
          "filename": "textbook-science-1.webp",
          "product_id": "P034",
          "name": "Science Textbook",
          "price": 24.99,
          "description": "A hardcover Science textbook featuring a pastel gradient cover with icons of atoms and molecules. Includes detailed science topics and illustrations."
        },
        {
          "id": 35,
          "promptUsed": "A hardcover textbook for Programming with a clean and professional design. The cover features a pastel gradient background transitioning from soft pur",
          "imageGeneratedBy": "DALL-E",
          "filename": "textbook-programming-1.webp",
          "product_id": "P035",
          "name": "Programming Textbook",
          "price": 29.99,
          "description": "A modern Programming textbook with a sleek pastel gradient cover and bold text. Includes coding examples and technical exercises."
        }
      ]
    },
    {
      "title": "Electronics",
      "items": [
        {
          "id": 36,
          "promptUsed": "A small Chromebook packaged inside its box, displayed on a clean white surface. The box features a minimalist design with a matte white exterior and a",
          "imageGeneratedBy": "DALL-E",
          "filename": "chromebook-2.webp",
          "product_id": "P037",
          "name": "Compact Chromebook",
          "price": 199.99,
          "description": "A lightweight Chromebook with a sleek silver design, ideal for students. Features an HD display and seamless Chrome OS performance."
        },
        {
          "id": 37,
          "promptUsed": "A sleek, small Chromebook with a minimalist design. The Chromebook features a thin, lightweight body with a matte silver finish. The screen displays a",
          "imageGeneratedBy": "DALL-E",
          "filename": "chromebook-1.webp",
          "product_id": "P036",
          "name": "Sleek Small Chromebook",
          "price": 199.99,
          "description": "A sleek, small Chromebook with a minimalist design. The Chromebook features a thin, lightweight body with a matte silver finish. The screen displays a clean and functional interface."
        }
      ]
    }
  ]
}
